[
  {
    "slug": "getting-started-with-swimming",
    "title": "Getting Started with Swimming",
    "excerpt": "Your first steps into the pool. Tips for beginners.",
    "author": "coach-cathy",
    "publishedAt": "2026-01-15",
    "content": [
      "Swimming is a lifetime skill—one that builds strength, confidence, and a love for the water. Whether you're learning as a child or taking it up later in life, the journey always begins the same way: with comfort in the water.",
      "Before you focus on strokes or speed, it's essential to feel at ease. Spend time in shallow water. Let your feet touch the bottom. Move slowly. Breathe. Many new swimmers rush into technique, but the best foundation is simply getting used to the sensation of being submerged.",
      "Start with basics: blowing bubbles, putting your face in the water, and floating on your back or stomach with support. These exercises build water confidence without pressure. A qualified instructor can guide you through each step and correct your form early.",
      "As you progress, focus on one skill at a time. The freestyle stroke is often taught first because it's efficient and natural. Remember: swimming is about rhythm and relaxation, not force. Tight muscles sink; relaxed bodies float.",
      "Set small goals. Maybe this week you'll submerge your face. Next week you'll float for five seconds. Celebrate each win. Every champion in the pool started exactly where you are—at the beginning.",
      "Ready to take the plunge? Reach out to Coach Cathy or HydroSafe for lessons tailored to your level. We meet you where you are and help you grow at your own pace. The water is waiting."
    ]
  },
  {
    "slug": "water-safety-essentials",
    "title": "Water Safety Essentials",
    "excerpt": "Key safety practices every swimmer should know.",
    "author": "coach-cathy",
    "publishedAt": "2026-02-01",
    "content": [
      "Safety first. Whether you're in a pool, lake, or ocean, knowing the fundamentals can save lives. Water safety isn't just for beginners—it's for everyone who enters the water.",
      "Never swim alone. Always have a buddy or ensure a lifeguard is on duty. Even strong swimmers can get tired, cramp, or hit their head. A partner can get help or assist you if something goes wrong.",
      "Know your limits. Cold water, currents, and fatigue can overwhelm even experienced swimmers. If you feel tired, get out. If conditions look rough, stay on shore. There's no shame in waiting for a safer day.",
      "Learn basic rescue. You don't need to be a lifeguard to help. Reach or throw—don't go—is the golden rule. Use a pole, rope, or flotation device to pull someone to safety instead of jumping in yourself.",
      "Supervise children constantly. Drowning is silent and fast. Designate a water watcher when kids are near water. No phones, no distractions. Eyes on the water at all times.",
      "Take a course. HydroSafe offers water safety training for all ages. Learn CPR, first aid, and rescue skills. The confidence you gain could make the difference when it matters most."
    ]
  }
]
